# Data Engineering 1: Lab 04
---------------

### Task 01: Read the customers.

##### a) Create a DataFrame called customers with the customers.csv file. Print the count of customers and 5 entries to have a look at the data.

In [123]:
import pandas as pd

cust = pd.read_csv('../Grundlagen/DE1_Lab04/DE1_Lab04_customers.csv')
cust.name.count()

999

##### b) Get the count of customers per each status.

In [124]:
cust.groupby(by='status').count()

         id  name  bdate  city  canton
status
bronze  326   326    326   326     326
gold    331   331    331   331     331
silver  342   342    342   342     342

##### c) Get the count of customers per each city and check the result. Clean the messy entries and print the result again.

In [125]:
cust.groupby(by='city').count()

              id  name  status  bdate  canton
city
Buelach       66    66      66     66      66
Bülach        61    61      61     61      61
Frauenfeld    59    59      59     59      59
Gossau        98    98      98     98      98
Kreuzlingen   74    74      74     74      74
Romanshorn    65    65      65     65      65
Sankt Gallen  86    86      86     86      86
St Gallen     74    74      74     74      74
St. Gallen    79    79      79     79      79
Uster         65    65      65     65      65
Wil           69    69      69     69      69
Winterthur    77    77      77     77      77
Zuerich       62    62      62     62      62
Zürich        64    64      64     64      64

In [126]:
cust['city'] = cust['city'].replace('Bülach', 'Buelach')
cust['city'] = cust['city'].replace('Sankt Gallen', 'St Gallen')
cust['city'] = cust['city'].replace('St. Gallen', 'St Gallen')
cust['city'] = cust['city'].replace('Zürich', 'Zuerich')

In [127]:
cust.groupby(by='city').count()

              id  name  status  bdate  canton
city
Buelach      127   127     127    127     127
Frauenfeld    59    59      59     59      59
Gossau        98    98      98     98      98
Kreuzlingen   74    74      74     74      74
Romanshorn    65    65      65     65      65
St Gallen    239   239     239    239     239
Uster         65    65      65     65      65
Wil           69    69      69     69      69
Winterthur    77    77      77     77      77
Zuerich      126   126     126    126     126

##### d) Add the canton information to the entries and get the count of customers per each status and canton.

In [128]:
cust.loc[cust['city'] == 'Buelach', 'canton'] = 'ZH'
cust.loc[cust['city'] == 'Frauenfeld', 'canton'] = 'TG'
cust.loc[cust['city'] == 'Gossau', 'canton'] = 'ZH'
cust.loc[cust['city'] == 'Kreuzlingen', 'canton'] = 'TG'
cust.loc[cust['city'] == 'Romanshorn', 'canton'] = 'TG'
cust.loc[cust['city'] == 'St Gallen', 'canton'] = 'SG'
cust.loc[cust['city'] == 'Uster', 'canton'] = 'ZH'
cust.loc[cust['city'] == 'Wil', 'canton'] = 'TG'
cust.loc[cust['city'] == 'Winterthur', 'canton'] = 'ZH'
cust.loc[cust['city'] == 'Zuerich', 'canton'] = 'ZH'

In [129]:
cust.groupby(by='canton').count()

         id  name  status  bdate  city
canton
SG      239   239     239    239   239
TG      267   267     267    267   267
ZH      493   493     493    493   493

### Task 02: Read the transactions.

##### a) Create a DataFrame called transactions with the transactions.csv file. Print the count of transactions and 5 entries to have a look at the data

In [130]:
transactions = pd.read_csv('../Grundlagen/DE1_Lab04/DE1_Lab04_transactions.csv')
transactions

        id  customer  article                 date  price
0        1       628  Whiskey  2021-01-14 23:00:02   4.03
1        2       298     Coke  2021-12-29 03:51:24   2.14
2        3       908  Whiskey  2021-11-06 01:40:58   3.67
3        4       325      Gin  2021-05-24 05:51:52   4.46
4        5       242    Tonic  2021-05-17 04:21:13   4.58
...    ...       ...      ...                  ...    ...
9994  9995       864    Fries  2021-03-19 22:27:50   3.31
9995  9996       749     Coke  2021-06-11 15:43:28   2.89
9996  9997       478    Tonic  2021-07-29 01:41:24   0.97
9997  9998       807   Nachos  2021-06-03 23:36:52   1.89
9998  9999       246    Pizza  2021-10-30 17:44:13   2.93

[9999 rows x 5 columns]

##### b) Get the count of all transactions for the article whiskey.

In [131]:
transactions[transactions['article'] == 'Whiskey']['id'].count()

819

##### c) Get the count of articles per each article.

In [132]:
transactions.groupby('article').count()

            id  customer  date  price
article
Beer       846       846   846    846
Burger     830       830   830    830
Chips      865       865   865    865
Coke       805       805   805    805
Fries      790       790   790    790
Gin        859       859   859    859
Guacamole  818       818   818    818
Nachos     850       850   850    850
Pizza      843       843   843    843
Popcorn    840       840   840    840
Tonic      834       834   834    834
Whiskey    819       819   819    819

### Task 03: Doing Analytics.

##### a) Calculate the sum of all sold articles to the customer with the name 'Beverly Heifner'.

In [139]:
cust.rename(columns={'id': 'customer_id'}, inplace=True)
transactions.rename(columns={'customer': 'customer_id'}, inplace=True)
exp_transactions = pd.merge(transactions, cust, on='customer_id')
exp_transactions

,id,customer_id,article,date,price,name,status,bdate,city,canton
0,1,628,Whiskey,2021-01-14 23:00:02,4.03,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
1,2768,628,Burger,2021-10-20 06:57:47,2.88,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
2,4960,628,Tonic,2021-06-28 17:53:10,4.64,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
3,7778,628,Chips,2021-11-26 08:38:47,4.18,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
4,8818,628,Pizza,2021-03-10 07:34:58,0.59,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
...,...,...,...,...,...,...,...,...,...,...
9994,7417,789,Pizza,2021-11-25 12:46:52,3.76,Lori Moy,silver,1994-10-04 06:38:53,Zuerich,ZH
9995,7640,789,Beer,2021-11-20 10:34:03,4.58,Lori Moy,silver,1994-10-04 06:38:53,Zuerich,ZH
9996,9629,789,Burger,2021-08-19 07:02:36,3.31,Lori Moy,silver,1994-10-04 06:38:53,Zuerich,ZH
9997,8337,728,Tonic,2021-03-16 21:48:18,1.05,Clinton Scott,bronze,1965-10-11 05:31:20,Kreuzlingen,TG
9998,9649,728,Pizza,2021-10-09 15:10:17,1.95,Clinton Scott,bronze,1965-10-11 05:31:20,Kreuzlingen,TG

In [147]:
exp_transactions['price'][exp_transactions['name'] == 'Beverly Heifner'].sum()

52.94

##### b) Calculate the sum of all sold articles to customers from the city Uster.

In [148]:
exp_transactions['price'][exp_transactions['city'] == 'Uster'].sum()

1931.04

##### c) Calculate the average price of all sold articles to customers from the canton Thurgau.

In [149]:
exp_transactions['price'][exp_transactions['canton'] == 'TG'].mean()

2.9831782657238555

##### d) Calculate the sum of all sold articles in the month March.

In [157]:
exp_transactions[exp_transactions['date'].str.slice(5, 7) == '03']['price'].sum()

2407.7400000000002

##### e) Calculate the sum of all sold articles in the month October from customers with the status gold.

In [202]:
exp_transactions[(exp_transactions.date.str.slice(5, 7) == '03') & (exp_transactions.status == 'gold')]['price'].sum()

759.4300000000001

##### f) Calculate the sum of all sold articles between the hours 21 to 23.

In [211]:
restrans = transactions.query("date.str.slice(11, 13) == '21' | date.str.slice(11, 13) == '22'")
restrans['price'].sum()
exp_transactions

,id,customer_id,article,date,price,name,status,bdate,city,canton
0,1,628,Whiskey,2021-01-14 23:00:02,4.03,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
1,2768,628,Burger,2021-10-20 06:57:47,2.88,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
2,4960,628,Tonic,2021-06-28 17:53:10,4.64,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
3,7778,628,Chips,2021-11-26 08:38:47,4.18,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
4,8818,628,Pizza,2021-03-10 07:34:58,0.59,Carlos Balderas,silver,1995-03-27 10:44:04,Zuerich,ZH
...,...,...,...,...,...,...,...,...,...,...
9994,7417,789,Pizza,2021-11-25 12:46:52,3.76,Lori Moy,silver,1994-10-04 06:38:53,Zuerich,ZH
9995,7640,789,Beer,2021-11-20 10:34:03,4.58,Lori Moy,silver,1994-10-04 06:38:53,Zuerich,ZH
9996,9629,789,Burger,2021-08-19 07:02:36,3.31,Lori Moy,silver,1994-10-04 06:38:53,Zuerich,ZH
9997,8337,728,Tonic,2021-03-16 21:48:18,1.05,Clinton Scott,bronze,1965-10-11 05:31:20,Kreuzlingen,TG
9998,9649,728,Pizza,2021-10-09 15:10:17,1.95,Clinton Scott,bronze,1965-10-11 05:31:20,Kreuzlingen,TG

##### g) Calculate the average price of all sold whiskeys to customers born after or in 1980.

In [213]:
transactions_whiskey = transactions.query("article == 'Whiskey'")
customers_1980 = exp_transactions[exp_transactions['bdate'].str.slice(0,4).astype(int) >= 1980]['id'].to_list()

result = transactions_whiskey[transactions_whiskey['customer_id'].isin(customers_1980)]
result['price'].mean()

3.053409669211196

##### h) Which month has the highest count of sold whiskeys?

In [214]:
df_new = transactions_whiskey.assign(month = transactions_whiskey.date.str.slice(5,7).to_list())
df_new.groupby(['month']).count().price.sort_values(ascending=False)

month
05    79
04    76
01    73
08    73
12    70
11    67
06    66
07    66
10    65
03    64
09    64
02    56
Name: price, dtype: int64

##### i) Which month has the highest amount of sold gins?

In [220]:
df_gin = exp_transactions.query('article == "Gin"')
df_month = df_gin.assign(month = df_gin.date.str.slice(5,7).to_list())
df_month.groupby(['month']).sum().price.sort_values(ascending=False)

C:\Users\jonas\AppData\Local\Temp\ipykernel_540\616461915.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_month.groupby(['month']).sum().price.sort_values(ascending=False)

month
12    247.50
09    238.77
03    229.93
07    228.42
01    216.88
10    216.70
11    210.44
05    208.55
06    205.55
02    189.92
04    185.28
08    178.64
Name: price, dtype: float64

##### j) Which is the customer with the highest revenue?

In [195]:
exp_transactions.groupby('customer_id')['price'].sum().sort_values(ascending=False).head(1)

customer_id
958    68.48
Name: price, dtype: float64

##### k) Which canton has the highest revenue?

In [196]:
exp_transactions.groupby('canton')['price'].sum().sort_values(ascending=False).head(1)

canton
ZH    14740.43
Name: price, dtype: float64